questions = {
  1 : 'Вы бы хотели командовать армией во времена огнестрельного оружия?(нет - раньше)',
  2 : 'Считаете ли вы важным управление ресурсами и экономикой в игре?',
  3 : 'Вам важно чтобы в игре был флот и морские сражения?',
  4 : 'Вы за присутствие в игре чудовищных существ, героев и прочей магии?(да если не против)',
  5 : 'Важно ли для вас наличие многопользовательских режимов и соревновательного игрового опыта?',
  6 : 'Вам важно чтобы в игре были славянские нации?',
  7 : 'Важна ли для вас графика и визуальное исполнение в стратегических играх?',
  8 : 'Вам нравится управление нацией в условиях внутренних конфликтов и восстаний?',
  9 : 'Вы новичек и вам лучше выбрать более легкую часть?',
  10 : 'Вы готовы потратить больше 3к на одну игру?',
  11 : 'Ваш стиль игры больше включал бы грабежи и налеты(ответ нет подразумевает дипломатический или имперский подход)?',
  12 : 'Вам важна производительность игры?',
  13 : 'Вам важны моды, хотелось бы поставить мод и поиграть за воинства Средиземья?',
  14 : 'Вам важно, чтобы игра была сконцентрирована на исторической эпохе, ее действующих лицах?',
  15 : 'Вы против того чтобы поощрить жадность издателя?',
  16 : 'Вам нравятся более скоротечные, острые сражения?',
  17 : 'Вам важнее разнообразие игровых отрядов и уникальность их игровых механик?',
  18 : 'Вам важны интересные исторические сражения(особый режим, где вы играете конкретное сражение существовавшее в реальной истории с теми же силами, что были у военачальника тогда)?',
  19 : 'Вам важно сколько пространства занимает игра на диске(может занимать больше 100гб)?',
  20 : 'ВААААААААААААААААГХ?',
}



answer_options = {
  1 : {
    1 : { 0:0, 1:1, 2:2, 3:3, 4:0, 5:0, 6:0, 7:1 },
    2 : { 0:1, 1:0, 2:0, 3:0, 4:1, 5:1, 6:1, 7:0 }
  },
  2 : {
    1 : { 0:0, 1:0, 2:0, 3:1, 4:2, 5:4, 6:4, 7:0 },
    2 : { 0:1, 1:1, 2:1, 3:0, 4:0, 5:0, 6:0, 7:1 }
  },
  3 : {
    1 : { 0:0, 1:2, 2:3, 3:3, 4:2, 5:2, 6:0, 7:0 },
    2 : { 0:0, 1:0, 2:0, 3:0, 4:0, 5:0, 6:0, 7:0 }
  },
  4 : {
    1 : { 0:0, 1:0, 2:0, 3:0, 4:0, 5:0, 6:0, 7:3 },
    2 : { 0:1, 1:1, 2:1, 3:1, 4:1, 5:1, 6:1, 7:0 }
  },
  5 : {
    1 : { 0:0, 1:0, 2:0, 3:1, 4:1, 5:2, 6:2, 7:3 },
    2 : { 0:0, 1:0, 2:0, 3:0, 4:0, 5:0, 6:0, 7:0 }
  },
  6 : {
    1 : { 0:2, 1:2, 2:2, 3:0, 4:1, 5:2, 6:0, 7:0 },
    2 : { 0:0, 1:0, 2:0, 3:0, 4:0, 5:0, 6:0, 7:0 }
  },
  7 : {
    1 : { 0:0, 1:0, 2:0, 3:1, 4:1, 5:1, 6:2, 7:2 },
    2 : { 0:1, 1:1, 2:1, 3:0, 4:0, 5:0, 6:0, 7:0 }
  },
  8 : {
    1 : { 0:0, 1:0, 2:0, 3:1, 4:1, 5:2, 6:2, 7:0 },
    2 : { 0:1, 1:1, 2:1, 3:0, 4:0, 5:0, 6:0, 7:1 }
  },
  9 : {
    1 : { 0:0, 1:0, 2:2, 3:2, 4:2, 5:0, 6:1, 7:3 },
    2 : { 0:2, 1:0, 2:0, 3:0, 4:0, 5:2, 6:0, 7:0 }
  },
  10 : {
    1 : { 0:0, 1:0, 2:0, 3:0, 4:0, 5:0, 6:2, 7:2 },
    2 : { 0:2, 1:2, 2:2, 3:2, 4:2, 5:2, 6:0, 7:0 }
  },
  11 : {
    1 : { 0:0, 1:0, 2:0, 3:0, 4:2, 5:2, 6:2, 7:1 },
    2 : { 0:0, 1:0, 2:0, 3:0, 4:0, 5:0, 6:0, 7:0 }
  },
  12 : {
    1 : { 0:3, 1:3, 2:3, 3:2, 4:2, 5:1, 6:0, 7:0 },
    2 : { 0:0, 1:0, 2:0, 3:0, 4:0, 5:0, 6:0, 7:0 }
  },
  13 : {
    1 : { 0:1, 1:0, 2:0, 3:1, 4:2, 5:2, 6:0, 7:1 },
    2 : { 0:0, 1:0, 2:0, 3:0, 4:0, 5:0, 6:0, 7:0 }
  },
  14 : {
    1 : { 0:0, 1:1, 2:2, 3:0, 4:2, 5:2, 6:3, 7:0 },
    2 : { 0:0, 1:0, 2:0, 3:0, 4:0, 5:0, 6:0, 7:0 }
  },
  15 : {
    1 : { 0:1, 1:1, 2:1, 3:1, 4:1, 5:1, 6:0, 7:0 },
    2 : { 0:0, 1:0, 2:0, 3:0, 4:0, 5:0, 6:0, 7:0 }
  },
  16 : {
    1 : { 0:0, 1:0, 2:0, 3:3, 4:0, 5:0, 6:0, 7:0 },
    2 : { 0:1, 1:1, 2:1, 3:2, 4:1, 5:1, 6:1, 7:2 }
  },
  17 : {
    1 : { 0:0, 1:0, 2:0, 3:1, 4:0, 5:0, 6:2, 7:3 },
    2 : { 0:0, 1:0, 2:0, 3:0, 4:0, 5:0, 6:0, 7:0 }
  },
  18 : {
    1 : { 0:0, 1:0, 2:1, 3:2, 4:3, 5:3, 6:1, 7:0 },
    2 : { 0:0, 1:0, 2:0, 3:0, 4:0, 5:0, 6:0, 7:0 }
  },
  19 : {
    1 : { 0:3, 1:3, 2:2, 3:2, 4:1, 5:1, 6:0, 7:0 },
    2 : { 0:0, 1:0, 2:0, 3:0, 4:0, 5:0, 6:0, 7:0 }
  },
  20 : {
    1 : { 0:0, 1:0, 2:0, 3:0, 4:0, 5:0, 6:0, 7:3 },
    2 : { 0:0, 1:0, 2:0, 3:0, 4:0, 5:0, 6:0, 7:0 }
  },
}
